MENU = ('Факториалы:\n'
        '0. Дерево\n'
        '1. Квадраты\n'
        '2. Лединой фрактал 1\n'
        '3. Ледяной фрактал 2\n'
        '4. Кривая Коха\n'
        '5. Снежинка Коха\n'
        '6. Кривая Леви\n'
        '7. Кривая Минковского\n'
        '----------------------\n'
        'ПЕРСОНАЛЬНЫЕ ФРАКТАЛЫ:\n'
        '8. Фрактал Михаила\n'
        '9. Фрактал Глеба\n'
        '10. Фрактал Сергея\n'
        '11. Фрактал Федора.')

MENU_MIKHAIL = ('Факториалы:\n'
                '0. 6-ти гранная снежинка\n'
                '1. 3-х гранная снежинка')

INPUT_QUESTION = 'Выберете фрактал из списка --> '
ANIMATION = 'Отключить анимацию рисования или оставить? (1 - отключить; 0 - оставить) '

DEPTH = 'Глубина рекурсии: '
LENGTH = 'Длина стороны: '

VALUE_ERROR = 'Введите корректное значение.'
REC_ERROR = 'Слишком большое значение для глубины.'

